[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:68:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Songs" id="appnavbar-songs-dropdown" data-testid="appnavbar-songs-dropdown" >
-                    <NavDropdown.Item href="/songs/list" data-testid="appnavbar-songs-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/songs/create" data-testid="appnavbar-songs-create">Create</NavDropdown.Item>
-                      )
-                    }
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_USER") || <NavDropdown title="Songs" id="appnavbar-songs-dropdown" data-testid="appnavbar-songs-dropdown">
+                    <NavDropdown.Item href="/songs/list" data-testid="appnavbar-songs-list">List</NavDropdown.Item>
+                    {hasRole(currentUser, "ROLE_ADMIN") && <NavDropdown.Item href="/songs/create" data-testid="appnavbar-songs-create">Create</NavDropdown.Item>}
+                  </NavDropdown>
               }
             </Nav>
killedBy: AppNavbar tests renders the songs menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-songs-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:68:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Songs" id="appnavbar-songs-dropdown" data-testid="appnavbar-songs-dropdown" >
-                    <NavDropdown.Item href="/songs/list" data-testid="appnavbar-songs-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/songs/create" data-testid="appnavbar-songs-create">Create</NavDropdown.Item>
-                      )
-                    }
-                  </NavDropdown>
-                )
+                false
               }
             </Nav>
killedBy: AppNavbar tests renders the songs menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-songs-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:72:23
                   <NavDropdown title="Songs" id="appnavbar-songs-dropdown" data-testid="appnavbar-songs-dropdown" >
                     <NavDropdown.Item href="/songs/list" data-testid="appnavbar-songs-list">List</NavDropdown.Item>
                     {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/songs/create" data-testid="appnavbar-songs-create">Create</NavDropdown.Item>
-                      )
+                      false
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the songs menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-songs-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:72:23
                   <NavDropdown title="Songs" id="appnavbar-songs-dropdown" data-testid="appnavbar-songs-dropdown" >
                     <NavDropdown.Item href="/songs/list" data-testid="appnavbar-songs-list">List</NavDropdown.Item>
                     {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/songs/create" data-testid="appnavbar-songs-create">Create</NavDropdown.Item>
-                      )
+                      true
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the songs menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-songs-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >
