[Killed] BlockStatement
main/components/Restaurants/RestaurantTable.js:8:47
 
 const showCell = (cell) => JSON.stringify(cell.row.values);
 
-const defaultDeleteCallback = async (cell) => {
-    console.log(`deleteCallback: ${showCell(cell)})`);
-    restaurantUtils.del(cell.row.values.id);
-};
+const defaultDeleteCallback = async (cell) => {};
 
 export default function RestaurantTable({
killedBy: RestaurantTable tests Delete button calls delete callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Restaurants/RestaurantTable.js:17:20
     restaurants,
     deleteCallback = defaultDeleteCallback,
     showButtons = true,
-    testIdPrefix = "RestaurantTable",
+    testIdPrefix = "",
 }) {
     const navigate = useNavigate();
killedBy: RestaurantTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RestaurantTable-cell-row-0-col-id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/Restaurants/RestaurantTable.js:21:36
 }) {
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        console.log(`editCallback: ${showCell(cell)})`);
-        navigate(`/restaurants/edit/${cell.row.values.id}`);
-    };
+    const editCallback = (cell) => {};
 
     const detailsCallback = (cell) => {
killedBy: RestaurantTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/restaurants/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Restaurants/RestaurantTable.js:23:18
 
     const editCallback = (cell) => {
         console.log(`editCallback: ${showCell(cell)})`);
-        navigate(`/restaurants/edit/${cell.row.values.id}`);
+        navigate(``);
     };
 
killedBy: RestaurantTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/restaurants/edit/2"
Received: ""

Number of calls: 1

<html>

[Killed] BlockStatement
main/components/Restaurants/RestaurantTable.js:26:39
         navigate(`/restaurants/edit/${cell.row.values.id}`);
     };
 
-    const detailsCallback = (cell) => {
-        console.log(`detailsCallback: ${showCell(cell)})`);
-        navigate(`/restaurants/details/${cell.row.values.id}`);
-    };
+    const detailsCallback = (cell) => {};
 
     const columns = [
killedBy: RestaurantTable tests Details button navigates to the details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/restaurants/details/2"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/Restaurants/RestaurantTable.js:37:9
             accessor: "id", // accessor is the "key" in the data
         },
 
-        {
-            Header: "Name",
-            accessor: "name",
-        },
+        {},
         {
             Header: "Description",
killedBy: RestaurantTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!
