[Killed] BlockStatement
main/components/Songs/SongTable.js:10:47
 const showCell = (cell) => JSON.stringify(cell.row.values);
 
 
-const defaultDeleteCallback = async (cell) => {
-    console.log(`deleteCallback: ${showCell(cell)})`);
-    songUtils.del(cell.row.values.id);
-}
+const defaultDeleteCallback = async (cell) => {}
 
 export default function SongTable({
killedBy: SongTable tests Delete button calls delete callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/components/Songs/SongTable.js:23:36
 
     const navigate = useNavigate();
  
-    const editCallback = (cell) => {
-        console.log(`editCallback: ${showCell(cell)})`);
-        navigate(`/songs/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     const detailsCallback = (cell) => {
killedBy: SongTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/songs/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Songs/SongTable.js:25:18
  
     const editCallback = (cell) => {
         console.log(`editCallback: ${showCell(cell)})`);
-        navigate(`/songs/edit/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: SongTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/songs/edit/2"
Received: ""

Number of calls: 1

<html>

[Killed] BlockStatement
main/components/Songs/SongTable.js:28:39
         navigate(`/songs/edit/${cell.row.values.id}`)
     }
 
-    const detailsCallback = (cell) => {
-        console.log(`detailsCallback: ${showCell(cell)})`);
-        navigate(`/songs/details/${cell.row.values.id}`)
-    }
+    const detailsCallback = (cell) => {}
 
     const columns = [
killedBy: SongTable tests Details button navigates to the details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/songs/details/2"

Number of calls: 0

<html>
  <head />

[Killed] ArrayDeclaration
main/components/Songs/SongTable.js:33:21
         navigate(`/songs/details/${cell.row.values.id}`)
     }
 
-    const columns = [
-        {
-            Header: 'id',
-            accessor: 'id', // accessor is the "key" in the data
-        },
-
-        {
-            Header: 'Title',
-            accessor: 'title',
-        },
-        {
-            Header: 'Artist',
-            accessor: 'artist',
-        },
-        {
-            Header: 'Album',
-            accessor: 'album',
-        }
-    ];
+    const columns = [];
 
     const buttonColumns = [
killedBy: SongTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Songs/SongTable.js:43:9
             Header: 'Title',
             accessor: 'title',
         },
-        {
-            Header: 'Artist',
-            accessor: 'artist',
-        },
+        {},
         {
             Header: 'Album',
killedBy: SongTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!
