[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:33:26
                     <Navbar.Toggle />
 
                     <Nav className="me-auto">
-                        {systemInfo?.springH2ConsoleEnabled && (
-                            <>
-                                <Nav.Link href="/h2-console">
-                                    H2Console
-                                </Nav.Link>
-                            </>
-                        )}
+                        {systemInfo?.springH2ConsoleEnabled || <>
+                                <Nav.Link href="/h2-console">
+                                    H2Console
+                                </Nav.Link>
+                            </>}
                         {systemInfo?.showSwaggerUILink && (
                             <>
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: Error: Unable to find an element with the text: H2Console. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:33:26
                     <Navbar.Toggle />
 
                     <Nav className="me-auto">
-                        {systemInfo?.springH2ConsoleEnabled && (
-                            <>
-                                <Nav.Link href="/h2-console">
-                                    H2Console
-                                </Nav.Link>
-                            </>
-                        )}
+                        {true}
                         {systemInfo?.showSwaggerUILink && (
                             <>
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: Error: Unable to find an element with the text: H2Console. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:40:26
                                 </Nav.Link>
                             </>
                         )}
-                        {systemInfo?.showSwaggerUILink && (
-                            <>
-                                <Nav.Link href="/swagger-ui/index.html">
-                                    Swagger
-                                </Nav.Link>
-                            </>
-                        )}
+                        {true}
                     </Nav>
 
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Swagger. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:55:30
 
                     <Navbar.Collapse className="justify-content-between">
                         <Nav className="mr-auto">
-                            {hasRole(currentUser, "ROLE_ADMIN") && (
-                                <NavDropdown
-                                    title="Admin"
-                                    id="appnavbar-admin-dropdown"
-                                    data-testid="appnavbar-admin-dropdown"
-                                >
-                                    <NavDropdown.Item href="/admin/users">
-                                        Users
-                                    </NavDropdown.Item>
-                                </NavDropdown>
-                            )}
+                            {true}
                         </Nav>
 
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:55:30
 
                     <Navbar.Collapse className="justify-content-between">
                         <Nav className="mr-auto">
-                            {hasRole(currentUser, "ROLE_ADMIN") && (
-                                <NavDropdown
-                                    title="Admin"
-                                    id="appnavbar-admin-dropdown"
-                                    data-testid="appnavbar-admin-dropdown"
-                                >
-                                    <NavDropdown.Item href="/admin/users">
-                                        Users
-                                    </NavDropdown.Item>
-                                </NavDropdown>
-                            )}
+                            {false}
                         </Nav>
 
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:69:30
                         </Nav>
 
                         <Nav className="mr-auto">
-                            {hasRole(currentUser, "ROLE_USER") && (
-                                <NavDropdown
-                                    title="Todos"
-                                    id="appnavbar-todos-dropdown"
-                                    data-testid="appnavbar-todos-dropdown"
-                                >
-                                    <NavDropdown.Item href="/todos/list">
-                                        List Todos
-                                    </NavDropdown.Item>
-                                    <NavDropdown.Item href="/todos/create">
-                                        Create Todo
-                                    </NavDropdown.Item>
-                                </NavDropdown>
-                            )}
+                            {true}
                         </Nav>
 
killedBy: AppNavbar tests renders the todos menu correctly
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-todos-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:69:30
                         </Nav>
 
                         <Nav className="mr-auto">
-                            {hasRole(currentUser, "ROLE_USER") && (
-                                <NavDropdown
-                                    title="Todos"
-                                    id="appnavbar-todos-dropdown"
-                                    data-testid="appnavbar-todos-dropdown"
-                                >
-                                    <NavDropdown.Item href="/todos/list">
-                                        List Todos
-                                    </NavDropdown.Item>
-                                    <NavDropdown.Item href="/todos/create">
-                                        Create Todo
-                                    </NavDropdown.Item>
-                                </NavDropdown>
-                            )}
+                            {false}
                         </Nav>
 
killedBy: AppNavbar tests renders the todos menu correctly
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-todos-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:86:30
                         </Nav>
 
                         <Nav className="mr-auto">
-                            {hasRole(currentUser, "ROLE_USER") && (
-                                <NavDropdown
-                                    title="Songs"
-                                    id="appnavbar-songs-dropdown"
-                                    data-testid="appnavbar-songs-dropdown"
-                                >
-                                    <NavDropdown.Item
-                                        href="/songs/list"
-                                        data-testid="appnavbar-songs-list"
-                                    >
-                                        List
-                                    </NavDropdown.Item>
-                                    {hasRole(currentUser, "ROLE_ADMIN") && (
-                                        <NavDropdown.Item
-                                            href="/songs/create"
-                                            data-testid="appnavbar-songs-create"
-                                        >
-                                            Create
-                                        </NavDropdown.Item>
-                                    )}
-                                </NavDropdown>
-                            )}
+                            {hasRole(currentUser, "ROLE_USER") || <NavDropdown title="Songs" id="appnavbar-songs-dropdown" data-testid="appnavbar-songs-dropdown">
+                                    <NavDropdown.Item href="/songs/list" data-testid="appnavbar-songs-list">
+                                        List
+                                    </NavDropdown.Item>
+                                    {hasRole(currentUser, "ROLE_ADMIN") && <NavDropdown.Item href="/songs/create" data-testid="appnavbar-songs-create">
+                                            Create
+                                        </NavDropdown.Item>}
+                                </NavDropdown>}
                         </Nav>
 
killedBy: AppNavbar tests renders the songs menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-songs-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:86:30
                         </Nav>
 
                         <Nav className="mr-auto">
-                            {hasRole(currentUser, "ROLE_USER") && (
-                                <NavDropdown
-                                    title="Songs"
-                                    id="appnavbar-songs-dropdown"
-                                    data-testid="appnavbar-songs-dropdown"
-                                >
-                                    <NavDropdown.Item
-                                        href="/songs/list"
-                                        data-testid="appnavbar-songs-list"
-                                    >
-                                        List
-                                    </NavDropdown.Item>
-                                    {hasRole(currentUser, "ROLE_ADMIN") && (
-                                        <NavDropdown.Item
-                                            href="/songs/create"
-                                            data-testid="appnavbar-songs-create"
-                                        >
-                                            Create
-                                        </NavDropdown.Item>
-                                    )}
-                                </NavDropdown>
-                            )}
+                            {false}
                         </Nav>
 
killedBy: AppNavbar tests renders the songs menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-songs-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:98:38
                                     >
                                         List
                                     </NavDropdown.Item>
-                                    {hasRole(currentUser, "ROLE_ADMIN") && (
-                                        <NavDropdown.Item
-                                            href="/songs/create"
-                                            data-testid="appnavbar-songs-create"
-                                        >
-                                            Create
-                                        </NavDropdown.Item>
-                                    )}
+                                    {true}
                                 </NavDropdown>
                             )}
killedBy: AppNavbar tests renders the songs menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-songs-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:98:38
                                     >
                                         List
                                     </NavDropdown.Item>
-                                    {hasRole(currentUser, "ROLE_ADMIN") && (
-                                        <NavDropdown.Item
-                                            href="/songs/create"
-                                            data-testid="appnavbar-songs-create"
-                                        >
-                                            Create
-                                        </NavDropdown.Item>
-                                    )}
+                                    {false}
                                 </NavDropdown>
                             )}
killedBy: AppNavbar tests renders the songs menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-songs-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:111:30
                         </Nav>
 
                         <Nav className="mr-auto">
-                            {hasRole(currentUser, "ROLE_USER") && (
-                                <NavDropdown
-                                    title="Restaurants"
-                                    id="appnavbar-restaurants-dropdown"
-                                    data-testid="appnavbar-restaurants-dropdown"
-                                >
-                                    <NavDropdown.Item
-                                        href="/restaurants/list"
-                                        data-testid="appnavbar-restaurants-list"
-                                    >
-                                        List
-                                    </NavDropdown.Item>
-                                    {hasRole(currentUser, "ROLE_ADMIN") && (
-                                        <NavDropdown.Item
-                                            href="/restaurants/create"
-                                            data-testid="appnavbar-restaurants-create"
-                                        >
-                                            Create
-                                        </NavDropdown.Item>
-                                    )}
-                                </NavDropdown>
-                            )}
+                            {true}
                         </Nav>
 
killedBy: AppNavbar tests renders the restaurants menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-restaurants-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:111:30
                         </Nav>
 
                         <Nav className="mr-auto">
-                            {hasRole(currentUser, "ROLE_USER") && (
-                                <NavDropdown
-                                    title="Restaurants"
-                                    id="appnavbar-restaurants-dropdown"
-                                    data-testid="appnavbar-restaurants-dropdown"
-                                >
-                                    <NavDropdown.Item
-                                        href="/restaurants/list"
-                                        data-testid="appnavbar-restaurants-list"
-                                    >
-                                        List
-                                    </NavDropdown.Item>
-                                    {hasRole(currentUser, "ROLE_ADMIN") && (
-                                        <NavDropdown.Item
-                                            href="/restaurants/create"
-                                            data-testid="appnavbar-restaurants-create"
-                                        >
-                                            Create
-                                        </NavDropdown.Item>
-                                    )}
-                                </NavDropdown>
-                            )}
+                            {hasRole(currentUser, "ROLE_USER") || <NavDropdown title="Restaurants" id="appnavbar-restaurants-dropdown" data-testid="appnavbar-restaurants-dropdown">
+                                    <NavDropdown.Item href="/restaurants/list" data-testid="appnavbar-restaurants-list">
+                                        List
+                                    </NavDropdown.Item>
+                                    {hasRole(currentUser, "ROLE_ADMIN") && <NavDropdown.Item href="/restaurants/create" data-testid="appnavbar-restaurants-create">
+                                            Create
+                                        </NavDropdown.Item>}
+                                </NavDropdown>}
                         </Nav>
 
killedBy: AppNavbar tests renders the restaurants menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-restaurants-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:123:38
                                     >
                                         List
                                     </NavDropdown.Item>
-                                    {hasRole(currentUser, "ROLE_ADMIN") && (
-                                        <NavDropdown.Item
-                                            href="/restaurants/create"
-                                            data-testid="appnavbar-restaurants-create"
-                                        >
-                                            Create
-                                        </NavDropdown.Item>
-                                    )}
+                                    {false}
                                 </NavDropdown>
                             )}
killedBy: AppNavbar tests renders the restaurants menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-restaurants-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:123:38
                                     >
                                         List
                                     </NavDropdown.Item>
-                                    {hasRole(currentUser, "ROLE_ADMIN") && (
-                                        <NavDropdown.Item
-                                            href="/restaurants/create"
-                                            data-testid="appnavbar-restaurants-create"
-                                        >
-                                            Create
-                                        </NavDropdown.Item>
-                                    )}
+                                    {hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown.Item href="/restaurants/create" data-testid="appnavbar-restaurants-create">
+                                            Create
+                                        </NavDropdown.Item>}
                                 </NavDropdown>
                             )}
killedBy: AppNavbar tests renders the restaurants menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-restaurants-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:136:30
                         </Nav>
 
                         <Nav className="mr-auto">
-                            {hasRole(currentUser, "ROLE_USER") && (
-                                <NavDropdown
-                                    title="UCSBDates"
-                                    id="appnavbar-ucsbdates-dropdown"
-                                    data-testid="appnavbar-ucsbdates-dropdown"
-                                >
-                                    <NavDropdown.Item
-                                        href="/ucsbdates/list"
-                                        data-testid="appnavbar-ucsbdates-list"
-                                    >
-                                        List
-                                    </NavDropdown.Item>
-                                    {hasRole(currentUser, "ROLE_ADMIN") && (
-                                        <NavDropdown.Item
-                                            href="/ucsbdates/create"
-                                            data-testid="appnavbar-ucsbdates-create"
-                                        >
-                                            Create
-                                        </NavDropdown.Item>
-                                    )}
-                                </NavDropdown>
-                            )}
+                            {false}
                         </Nav>
 
killedBy: AppNavbar tests renders the ucsbdates menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-ucsbdates-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:136:30
                         </Nav>
 
                         <Nav className="mr-auto">
-                            {hasRole(currentUser, "ROLE_USER") && (
-                                <NavDropdown
-                                    title="UCSBDates"
-                                    id="appnavbar-ucsbdates-dropdown"
-                                    data-testid="appnavbar-ucsbdates-dropdown"
-                                >
-                                    <NavDropdown.Item
-                                        href="/ucsbdates/list"
-                                        data-testid="appnavbar-ucsbdates-list"
-                                    >
-                                        List
-                                    </NavDropdown.Item>
-                                    {hasRole(currentUser, "ROLE_ADMIN") && (
-                                        <NavDropdown.Item
-                                            href="/ucsbdates/create"
-                                            data-testid="appnavbar-ucsbdates-create"
-                                        >
-                                            Create
-                                        </NavDropdown.Item>
-                                    )}
-                                </NavDropdown>
-                            )}
+                            {hasRole(currentUser, "ROLE_USER") || <NavDropdown title="UCSBDates" id="appnavbar-ucsbdates-dropdown" data-testid="appnavbar-ucsbdates-dropdown">
+                                    <NavDropdown.Item href="/ucsbdates/list" data-testid="appnavbar-ucsbdates-list">
+                                        List
+                                    </NavDropdown.Item>
+                                    {hasRole(currentUser, "ROLE_ADMIN") && <NavDropdown.Item href="/ucsbdates/create" data-testid="appnavbar-ucsbdates-create">
+                                            Create
+                                        </NavDropdown.Item>}
+                                </NavDropdown>}
                         </Nav>
 
killedBy: AppNavbar tests renders the ucsbdates menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-ucsbdates-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:148:38
                                     >
                                         List
                                     </NavDropdown.Item>
-                                    {hasRole(currentUser, "ROLE_ADMIN") && (
-                                        <NavDropdown.Item
-                                            href="/ucsbdates/create"
-                                            data-testid="appnavbar-ucsbdates-create"
-                                        >
-                                            Create
-                                        </NavDropdown.Item>
-                                    )}
+                                    {true}
                                 </NavDropdown>
                             )}
killedBy: AppNavbar tests renders the ucsbdates menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-ucsbdates-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:148:38
                                     >
                                         List
                                     </NavDropdown.Item>
-                                    {hasRole(currentUser, "ROLE_ADMIN") && (
-                                        <NavDropdown.Item
-                                            href="/ucsbdates/create"
-                                            data-testid="appnavbar-ucsbdates-create"
-                                        >
-                                            Create
-                                        </NavDropdown.Item>
-                                    )}
+                                    {hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown.Item href="/ucsbdates/create" data-testid="appnavbar-ucsbdates-create">
+                                            Create
+                                        </NavDropdown.Item>}
                                 </NavDropdown>
                             )}
killedBy: AppNavbar tests renders the ucsbdates menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-ucsbdates-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >
