[Killed] BlockStatement
main/pages/Restaurants/RestaurantCreatePage.js:6:48
 import { useNavigate } from "react-router-dom";
 import { restaurantUtils } from "main/utils/restaurantUtils";
 
-export default function RestaurantCreatePage() {
-    let navigate = useNavigate();
-
-    const onSubmit = async (restaurant) => {
-        const createdRestaurant = restaurantUtils.add(restaurant);
-        console.log("createdRestaurant: " + JSON.stringify(createdRestaurant));
-        navigate("/restaurants/list");
-    };
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Create New Restaurant</h1>
-                <RestaurantForm submitAction={onSubmit} />
-            </div>
-        </BasicLayout>
-    );
-}
+export default function RestaurantCreatePage() {}
 
killedBy: RestaurantCreatePage tests renders without crashing
statusReason: Error: RestaurantCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Restaurants/RestaurantCreatePage.js:9:44
 export default function RestaurantCreatePage() {
     let navigate = useNavigate();
 
-    const onSubmit = async (restaurant) => {
-        const createdRestaurant = restaurantUtils.add(restaurant);
-        console.log("createdRestaurant: " + JSON.stringify(createdRestaurant));
-        navigate("/restaurants/list");
-    };
+    const onSubmit = async (restaurant) => {};
 
     return (
killedBy: RestaurantCreatePage tests redirects to /restaurants on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
