[Killed] BlockStatement
main/pages/Restaurants/RestaurantEditPage.js:14:44
 
     const response = restaurantUtils.getById(id);
 
-    const onSubmit = async (restaurant) => {
-        const updatedRestaurant = restaurantUtils.update(restaurant);
-        console.log("updatedRestaurant: " + JSON.stringify(updatedRestaurant));
-        navigate("/restaurants/list");
-    };
+    const onSubmit = async (restaurant) => {};
 
     return (
killedBy: RestaurantEditPage tests redirects to /restaurants on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
