[Killed] BlockStatement
main/pages/Restaurants/RestaurantIndexPage.js:16:44
 
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
-    const deleteCallback = async (cell) => {
-        console.log(`RestaurantIndexPage deleteCallback: ${showCell(cell)})`);
-        restaurantUtils.del(cell.row.values.id);
-        navigate("/restaurants/list");
-    };
+    const deleteCallback = async (cell) => {};
 
     return (
killedBy: RestaurantIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
main/pages/Restaurants/RestaurantIndexPage.js:19:18
     const deleteCallback = async (cell) => {
         console.log(`RestaurantIndexPage deleteCallback: ${showCell(cell)})`);
         restaurantUtils.del(cell.row.values.id);
-        navigate("/restaurants/list");
+        navigate("");
     };
 
killedBy: RestaurantIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/restaurants/list"
Received: ""

Number of calls: 1

<html>
