[Killed] BlockStatement
main/pages/Songs/SongCreatePage.js:6:42
 import { useNavigate } from 'react-router-dom'
 import { songUtils } from 'main/utils/songUtils';
 
-export default function SongCreatePage() {
-
-  let navigate = useNavigate(); 
-
-  const onSubmit = async (song) => {
-    const createdSong = songUtils.add(song);
-    console.log("createdSong: " + JSON.stringify(createdSong));
-    navigate("/songs/list");
-  }  
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create New Song</h1>
-        <SongForm submitAction={onSubmit} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function SongCreatePage() {}
 
killedBy: SongCreatePage tests renders without crashing
statusReason: Error: SongCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Songs/SongCreatePage.js:10:36
 
   let navigate = useNavigate(); 
 
-  const onSubmit = async (song) => {
-    const createdSong = songUtils.add(song);
-    console.log("createdSong: " + JSON.stringify(createdSong));
-    navigate("/songs/list");
-  }  
+  const onSubmit = async (song) => {}  
 
   return (
killedBy: SongCreatePage tests redirects to /songs on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
