[Killed] BlockStatement
main/pages/Songs/SongDetailsPage.js:6:43
 import SongTable from 'main/components/Songs/SongTable';
 import { songUtils } from 'main/utils/songUtils';
 
-export default function SongDetailsPage() {
-  let { id } = useParams();
-
-  const response = songUtils.getById(id);
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Song Details</h1>
-        <SongTable songs={[response.song]} showButtons={false} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function SongDetailsPage() {}
 
killedBy: SongDetailsPage tests renders without crashing
statusReason: Error: SongDetailsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BooleanLiteral
main/pages/Songs/SongDetailsPage.js:15:57
     <BasicLayout>
       <div className="pt-2">
         <h1>Song Details</h1>
-        <SongTable songs={[response.song]} showButtons={false} />
+        <SongTable songs={[response.song]} showButtons={true} />
       </div>
     </BasicLayout>
killedBy: SongDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Found multiple elements with the text: Delete

Here are the matching elements:

<th
  colspan="1"
  data-testid="SongTable-header-Delete"
  role="columnheader"

[Killed] ArrayDeclaration
main/pages/Songs/SongDetailsPage.js:15:27
     <BasicLayout>
       <div className="pt-2">
         <h1>Song Details</h1>
-        <SongTable songs={[response.song]} showButtons={false} />
+        <SongTable songs={[]} showButtons={false} />
       </div>
     </BasicLayout>
killedBy: SongDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: Love Story. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
