[Killed] BlockStatement
main/pages/Songs/SongEditPage.js:9:40
 import { useNavigate } from 'react-router-dom'
 
 
-export default function SongEditPage() {
-    let { id } = useParams();
-
-    let navigate = useNavigate(); 
-
-    const response = songUtils.getById(id);
-
-    const onSubmit = async (song) => {
-        const updatedSong = songUtils.update(song);
-        console.log("updatedSong: " + JSON.stringify(updatedSong));
-        navigate("/songs/list");
-    }  
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Edit Song</h1>
-                <SongForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.song}/>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function SongEditPage() {}
killedBy: SongEditPage tests renders without crashing
statusReason: Error: SongEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Songs/SongEditPage.js:16:38
 
     const response = songUtils.getById(id);
 
-    const onSubmit = async (song) => {
-        const updatedSong = songUtils.update(song);
-        console.log("updatedSong: " + JSON.stringify(updatedSong));
-        navigate("/songs/list");
-    }  
+    const onSubmit = async (song) => {}  
 
     return (
killedBy: SongEditPage tests redirects to /songs on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Songs/SongEditPage.js:26:64
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Song</h1>
-                <SongForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.song}/>
+                <SongForm submitAction={onSubmit} buttonLabel={""} initialContents={response.song}/>
             </div>
         </BasicLayout>
killedBy: SongEditPage tests redirects to /songs on submit
statusReason: TestingLibraryElementError: Unable to find an element with the text: Update. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
