[Killed] BlockStatement
main/pages/Songs/SongIndexPage.js:17:44
 
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
-    const deleteCallback = async (cell) => {
-        console.log(`SongIndexPage deleteCallback: ${showCell(cell)})`);
-        songUtils.del(cell.row.values.id);
-        navigate("/songs/list");
-    }
+    const deleteCallback = async (cell) => {}
 
     return (
killedBy: SongIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
main/pages/Songs/SongIndexPage.js:20:18
     const deleteCallback = async (cell) => {
         console.log(`SongIndexPage deleteCallback: ${showCell(cell)})`);
         songUtils.del(cell.row.values.id);
-        navigate("/songs/list");
+        navigate("");
     }
 
killedBy: SongIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/songs/list"
Received: ""

Number of calls: 1

<html>

[Killed] ObjectLiteral
main/pages/Songs/SongIndexPage.js:26:32
     return (
         <BasicLayout>
             <div className="pt-2">
-                <Button style={{ float: "right" }} as={Link} to="/songs/create">
+                <Button style={{}} as={Link} to="/songs/create">
                     Create Song
                 </Button>
killedBy: SongIndexPage tests renders correct fields
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
