[Killed] BlockStatement
src/main/utils/songUtils.js:2:19
 // get songs from local storage
-const get = () => {
-    const songValue = localStorage.getItem("songs");
-    if (songValue === undefined) {
-        const songCollection = { nextId: 1, songs: [] }
-        return set(songCollection);
-    }
-    const songCollection = JSON.parse(songValue);
-    if (songCollection === null) {
-        const songCollection = { nextId: 1, songs: [] }
-        return set(songCollection);
-    }
-    return songCollection;
-};
+const get = () => {};
 
 const getById = (id) => {
killedBy: SongTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of undefined (reading 'songs')

[Killed] EqualityOperator
src/main/utils/songUtils.js:4:9
 // get songs from local storage
 const get = () => {
     const songValue = localStorage.getItem("songs");
-    if (songValue === undefined) {
+    if (songValue !== undefined) {
         const songCollection = { nextId: 1, songs: [] }
         return set(songCollection);
killedBy: songUtils tests get When songs is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] ConditionalExpression
src/main/utils/songUtils.js:4:9
 // get songs from local storage
 const get = () => {
     const songValue = localStorage.getItem("songs");
-    if (songValue === undefined) {
+    if (false) {
         const songCollection = { nextId: 1, songs: [] }
         return set(songCollection);
killedBy: songUtils tests get When songs is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] ArrayDeclaration
src/main/utils/songUtils.js:5:52
 const get = () => {
     const songValue = localStorage.getItem("songs");
     if (songValue === undefined) {
-        const songCollection = { nextId: 1, songs: [] }
+        const songCollection = { nextId: 1, songs: ["Stryker was here"] }
         return set(songCollection);
     }
killedBy: songUtils tests get When songs is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
    "nextId": 1,
-   "songs": Array [],

[Killed] EqualityOperator
src/main/utils/songUtils.js:9:9
         return set(songCollection);
     }
     const songCollection = JSON.parse(songValue);
-    if (songCollection === null) {
+    if (songCollection !== null) {
         const songCollection = { nextId: 1, songs: [] }
         return set(songCollection);
killedBy: songUtils tests get When songs is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"nextId": 1, "songs": []}
Received: null

[Killed] ConditionalExpression
src/main/utils/songUtils.js:9:9
         return set(songCollection);
     }
     const songCollection = JSON.parse(songValue);
-    if (songCollection === null) {
+    if (false) {
         const songCollection = { nextId: 1, songs: [] }
         return set(songCollection);
killedBy: songUtils tests get When songs is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"nextId": 1, "songs": []}
Received: null

[Killed] ArrayDeclaration
src/main/utils/songUtils.js:10:52
     }
     const songCollection = JSON.parse(songValue);
     if (songCollection === null) {
-        const songCollection = { nextId: 1, songs: [] }
+        const songCollection = { nextId: 1, songs: ["Stryker was here"] }
         return set(songCollection);
     }
killedBy: songUtils tests get When songs is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
    "nextId": 1,
-   "songs": Array [],

[Killed] BlockStatement
src/main/utils/songUtils.js:16:25
     return songCollection;
 };
 
-const getById = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const songCollection = get();
-    const songs = songCollection.songs;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = songs.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `song with id ${id} not found` };
-    }
-    return { song: songs[index] };
-}
+const getById = (id) => {}
 
 // set songs in local storage
killedBy: songUtils tests getById Check that getting a song by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"song": {"album": "Fearless", "artist": "Taylor Swift", "id": 3, "title": "Love Story"}}
Received: undefined

[Killed] ConditionalExpression
src/main/utils/songUtils.js:24:42
     const songs = songCollection.songs;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = songs.findIndex((r) => r.id == id);
+    const index = songs.findIndex((r) => false);
     if (index === -1) {
         return { "error": `song with id ${id} not found` };
killedBy: songUtils tests getById Check that getting a song by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "song": Object {
-     "album": "Fearless",

[Killed] EqualityOperator
src/main/utils/songUtils.js:24:42
     const songs = songCollection.songs;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = songs.findIndex((r) => r.id == id);
+    const index = songs.findIndex((r) => r.id != id);
     if (index === -1) {
         return { "error": `song with id ${id} not found` };
killedBy: songUtils tests getById Check that getting a song by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
    "song": Object {
-     "album": "Fearless",

[Killed] ConditionalExpression
src/main/utils/songUtils.js:25:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = songs.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (false) {
         return { "error": `song with id ${id} not found` };
     }
killedBy: songUtils tests getById Check that getting a non-existing song returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "song with id 99 not found",
+   "song": undefined,

[Killed] UnaryOperator
src/main/utils/songUtils.js:25:19
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = songs.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (index === +1) {
         return { "error": `song with id ${id} not found` };
     }
killedBy: songUtils tests getById Check that getting a song by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "song": Object {
-     "album": "Fearless",

[Killed] ObjectLiteral
src/main/utils/songUtils.js:28:12
     if (index === -1) {
         return { "error": `song with id ${id} not found` };
     }
-    return { song: songs[index] };
+    return {};
 }
 
killedBy: songUtils tests getById Check that getting a song by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Object {
-   "song": Object {
-     "album": "Fearless",

[Killed] BlockStatement
src/main/utils/songUtils.js:32:33
 }
 
 // set songs in local storage
-const set = (songCollection) => {
-    localStorage.setItem("songs", JSON.stringify(songCollection));
-    return songCollection;
-};
+const set = (songCollection) => {};
 
 // add a song to local storage
killedBy: songUtils tests get When songs is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"nextId": 1, "songs": []}
Received: undefined

[Killed] StringLiteral
src/main/utils/songUtils.js:33:26
 
 // set songs in local storage
 const set = (songCollection) => {
-    localStorage.setItem("songs", JSON.stringify(songCollection));
+    localStorage.setItem("", JSON.stringify(songCollection));
     return songCollection;
 };
killedBy: songUtils tests get When songs is undefined in local storage, should set to empty list
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "songs", "{\"nextId\":1,\"songs\":[]}"
Received: "", "{\"nextId\":1,\"songs\":[]}"

Number of calls: 1

[Killed] BlockStatement
src/main/utils/songUtils.js:38:23
 };
 
 // add a song to local storage
-const add = (song) => {
-    const songCollection = get();
-    song = { ...song, id: songCollection.nextId };
-    songCollection.nextId++;
-    songCollection.songs.push(song);
-    set(songCollection);
-    return song;
-};
+const add = (song) => {};
 
 // update a song in local storage
killedBy: songUtils tests add Starting from [], check that adding one song works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"album": "A Night at the Opera", "artist": "Queen", "id": 1, "title": "Bohemian Rhapsody"}
Received: undefined

[Killed] ObjectLiteral
src/main/utils/songUtils.js:40:12
 // add a song to local storage
 const add = (song) => {
     const songCollection = get();
-    song = { ...song, id: songCollection.nextId };
+    song = {};
     songCollection.nextId++;
     songCollection.songs.push(song);
killedBy: songUtils tests add Starting from [], check that adding one song works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Object {
-   "album": "A Night at the Opera",
-   "artist": "Queen",

[Killed] UpdateOperator
src/main/utils/songUtils.js:41:5
 const add = (song) => {
     const songCollection = get();
     song = { ...song, id: songCollection.nextId };
-    songCollection.nextId++;
+    songCollection.nextId--;
     songCollection.songs.push(song);
     set(songCollection);
killedBy: songUtils tests add Starting from [], check that adding one song works
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "songs", "{\"nextId\":2,\"songs\":[{\"id\":1,\"title\":\"Bohemian Rhapsody\",\"artist\":\"Queen\",\"album\":\"A Night at the Opera\"}]}"
Received: "songs", "{\"nextId\":0,\"songs\":[{\"id\":1,\"title\":\"Bohemian Rhapsody\",\"artist\":\"Queen\",\"album\":\"A Night at the Opera\"}]}"

Number of calls: 1

[Killed] BlockStatement
src/main/utils/songUtils.js:48:26
 };
 
 // update a song in local storage
-const update = (song) => {
-    const songCollection = get();
-
-    const songs = songCollection.songs;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = songs.findIndex((r) => r.id == song.id);
-    if (index === -1) {
-        return { "error": `song with id ${song.id} not found` };
-    }
-    songs[index] = song;
-    set(songCollection);
-    return { songCollection: songCollection };
-};
+const update = (song) => {};
 
 // delete a song from local storage
killedBy: songUtils tests update Check that updating an existing song works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ConditionalExpression
src/main/utils/songUtils.js:54:42
     const songs = songCollection.songs;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = songs.findIndex((r) => r.id == song.id);
+    const index = songs.findIndex((r) => false);
     if (index === -1) {
         return { "error": `song with id ${song.id} not found` };
killedBy: songUtils tests update Check that updating an existing song works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 24
+ Received  +  1

  Object {
-   "songCollection": Object {
-     "nextId": 5,

[Killed] ArrowFunction
src/main/utils/songUtils.js:54:35
     const songs = songCollection.songs;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = songs.findIndex((r) => r.id == song.id);
+    const index = songs.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `song with id ${song.id} not found` };
killedBy: songUtils tests update Check that updating an existing song works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 24
+ Received  +  1

  Object {
-   "songCollection": Object {
-     "nextId": 5,

[Killed] ConditionalExpression
src/main/utils/songUtils.js:55:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = songs.findIndex((r) => r.id == song.id);
-    if (index === -1) {
+    if (true) {
         return { "error": `song with id ${song.id} not found` };
     }
killedBy: songUtils tests update Check that updating an existing song works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 24
+ Received  +  1

  Object {
-   "songCollection": Object {
-     "nextId": 5,

[Killed] ConditionalExpression
src/main/utils/songUtils.js:55:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = songs.findIndex((r) => r.id == song.id);
-    if (index === -1) {
+    if (false) {
         return { "error": `song with id ${song.id} not found` };
     }
killedBy: songUtils tests update Check that updating an non-existing song returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 23

  Object {
-   "error": "song with id 99 not found",
+   "songCollection": Object {

[Killed] BlockStatement
src/main/utils/songUtils.js:64:21
 };
 
 // delete a song from local storage
-const del = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const songCollection = get();
-    const songs = songCollection.songs;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = songs.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `song with id ${id} not found` };
-    }
-    songs.splice(index, 1);
-    set(songCollection);
-    return { songCollection: songCollection };
-};
+const del = (id) => {};
 
 const songUtils = {
killedBy: songUtils tests del Check that deleting a song by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"songCollection": {"nextId": 5, "songs": [{"album": "Different Light", "artist": "The Bangles", "id": 2, "title": "Walk Like An Egyptian"}, {"album": "In The Zone", "artist": "Britney Spears", "id": 4, "title": "Toxic"}]}}
Received: undefined

[Killed] ArrowFunction
src/main/utils/songUtils.js:72:35
     const songs = songCollection.songs;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = songs.findIndex((r) => r.id == id);
+    const index = songs.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `song with id ${id} not found` };
killedBy: songUtils tests del Check that deleting a song by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

  Object {
-   "songCollection": Object {
-     "nextId": 5,

[Killed] ConditionalExpression
src/main/utils/songUtils.js:73:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = songs.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (true) {
         return { "error": `song with id ${id} not found` };
     }
killedBy: songUtils tests del Check that deleting a song by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

  Object {
-   "songCollection": Object {
-     "nextId": 5,

[Killed] BlockStatement
src/main/utils/songUtils.js:73:23
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = songs.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `song with id ${id} not found` };
-    }
+    if (index === -1) {}
     songs.splice(index, 1);
     set(songCollection);
killedBy: songUtils tests del Check that deleting a non-existing song returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 17

  Object {
-   "error": "song with id 99 not found",
+   "songCollection": Object {

[Killed] ObjectLiteral
src/main/utils/songUtils.js:74:16
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = songs.findIndex((r) => r.id == id);
     if (index === -1) {
-        return { "error": `song with id ${id} not found` };
+        return {};
     }
     songs.splice(index, 1);
killedBy: songUtils tests del Check that deleting a non-existing song returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "song with id 99 not found",
- }
