[Killed] BlockStatement
main/components/Restaurants/RestaurantTable.js:18:39
         navigate(`/restaurants/edit/${cell.row.values.id}`);
     };
 
-    const detailsCallback = (cell) => {
-        navigate(`/restaurants/details/${cell.row.values.id}`);
-    };
+    const detailsCallback = (cell) => {};
 
     // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Details button navigates to the details page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/restaurants/details/1"

Number of calls: 0

<html>
  <head />
