[Killed] BlockStatement
main/components/Songs/SongTable.js:11:36
 export default function SongTable({ songs, currentUser }) {
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/songs/edit/${cell.row.values.id}`);
-    };
+    const editCallback = (cell) => {};
 
     const detailsCallback = (cell) => {
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/songs/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/Songs/SongTable.js:15:39
         navigate(`/songs/edit/${cell.row.values.id}`);
     };
 
-    const detailsCallback = (cell) => {
-        navigate(`/songs/details/${cell.row.values.id}`);
-    };
+    const detailsCallback = (cell) => {};
 
     // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Details button navigates to the details page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/songs/details/1"

Number of calls: 0

<html>
  <head />
