[Killed] ArrowFunction
main/pages/Restaurants/RestaurantCreatePage.js:8:33
 import { toast } from "react-toastify";
 
 export default function RestaurantsCreatePage() {
-    const objectToAxiosParams = (restaurant) => ({
-        url: "/api/restaurants/post",
-        method: "POST",
-        params: {
-            name: restaurant.name,
-            description: restaurant.description,
-            location: restaurant.location,
-        },
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (restaurant) => {
killedBy: RestaurantCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Restaurants/RestaurantCreatePage.js:18:39
         },
     });
 
-    const onSuccess = (restaurant) => {
-        toast(
-            `New restaurant created - id: ${restaurant.id} name: ${restaurant.name}`
-        );
-    };
+    const onSuccess = (restaurant) => {};
 
     const mutation = useBackendMutation(
killedBy: RestaurantCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New restaurant created - id: 1 name: Name1"

Number of calls: 0

[Killed] BlockStatement
main/pages/Restaurants/RestaurantCreatePage.js:37:20
         mutation.mutate(data);
     };
 
-    if (isSuccess) {
-        return <Navigate to="/restaurants/list" />;
-    }
+    if (isSuccess) {}
 
     return (
killedBy: RestaurantCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/restaurants/list"}

Number of calls: 0
