[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantDetailsPage.js:21:21
             // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
             method: "GET",
             url: `/api/restaurants`,
-            params: {
-                id,
-            },
+            params: {},
         }
     );
killedBy: RestaurantDetailsPage tests renders one restaurant without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="RestaurantTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/Restaurants/RestaurantDetailsPage.js:31:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Restaurant Details</h1>
-                {restaurants && <RestaurantTable restaurants={[restaurants]} />}
+                {restaurants || <RestaurantTable restaurants={[restaurants]} />}
             </div>
         </BasicLayout>
killedBy: RestaurantDetailsPage tests renders without crashing for regular user
statusReason: TypeError: Cannot read properties of undefined (reading 'subRows')

[Killed] ConditionalExpression
main/pages/Restaurants/RestaurantDetailsPage.js:31:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Restaurant Details</h1>
-                {restaurants && <RestaurantTable restaurants={[restaurants]} />}
+                {false}
             </div>
         </BasicLayout>
killedBy: RestaurantDetailsPage tests renders one restaurant without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="RestaurantTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
