[Killed] ArrowFunction
main/pages/Restaurants/RestaurantEditPage.js:28:36
         }
     );
 
-    const objectToAxiosPutParams = (restaurant) => ({
-        url: "/api/restaurants",
-        method: "PUT",
-        params: {
-            id: restaurant.id,
-        },
-        data: {
-            name: restaurant.name,
-            description: restaurant.description,
-            location: restaurant.location,
-        },
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (restaurant) => {
killedBy: RestaurantEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Restaurant Updated - id: 17 name: Name2"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantEditPage.js:34:15
         params: {
             id: restaurant.id,
         },
-        data: {
-            name: restaurant.name,
-            description: restaurant.description,
-            location: restaurant.location,
-        },
+        data: {},
     });
 
killedBy: RestaurantEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"name\":\"Name2\",\"description\":\"Description2\",\"location\":\"Location2\"}"
Received: "{}"

[Killed] BlockStatement
main/pages/Restaurants/RestaurantEditPage.js:41:39
         },
     });
 
-    const onSuccess = (restaurant) => {
-        toast(
-            `Restaurant Updated - id: ${restaurant.id} name: ${restaurant.name}`
-        );
-    };
+    const onSuccess = (restaurant) => {};
 
     const mutation = useBackendMutation(
killedBy: RestaurantEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Restaurant Updated - id: 17 name: Name2"

Number of calls: 0

[Killed] LogicalOperator
main/pages/Restaurants/RestaurantEditPage.js:68:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Restaurant</h1>
-                {restaurant && (
-                    <RestaurantForm
-                        initialRestaurant={restaurant}
-                        submitAction={onSubmit}
-                        buttonLabel="Update"
-                    />
-                )}
+                {restaurant || <RestaurantForm initialRestaurant={restaurant} submitAction={onSubmit} buttonLabel="Update" />}
             </div>
         </BasicLayout>
killedBy: RestaurantEditPage tests when the backend doesn't return a todo renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="RestaurantForm-name" id="name" name="name" type="text" /> instead

[Killed] ConditionalExpression
main/pages/Restaurants/RestaurantEditPage.js:68:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Restaurant</h1>
-                {restaurant && (
-                    <RestaurantForm
-                        initialRestaurant={restaurant}
-                        submitAction={onSubmit}
-                        buttonLabel="Update"
-                    />
-                )}
+                {true}
             </div>
         </BasicLayout>
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RestaurantForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
