[Killed] ArrowFunction
main/pages/Songs/SongCreatePage.js:8:33
 import { toast } from "react-toastify";
 
 export default function SongsCreatePage() {
-    const objectToAxiosParams = (song) => ({
-        url: "/api/song/post",
-        method: "POST",
-        params: {
-            title: song.title,
-            artist: song.artist,
-            album: song.album,
-        },
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (song) => {
killedBy: SongCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Songs/SongCreatePage.js:9:14
 
 export default function SongsCreatePage() {
     const objectToAxiosParams = (song) => ({
-        url: "/api/song/post",
+        url: "",
         method: "POST",
         params: {
killedBy: SongCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New song created - id: 1 title: Title1"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/Songs/SongCreatePage.js:18:33
         },
     });
 
-    const onSuccess = (song) => {
-        toast(`New song created - id: ${song.id} title: ${song.title}`);
-    };
+    const onSuccess = (song) => {};
 
     const mutation = useBackendMutation(
killedBy: SongCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New song created - id: 1 title: Title1"

Number of calls: 0
