[Killed] ConditionalExpression
main/pages/Songs/SongDetailsPage.js:31:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Song Details</h1>
-                {songs && <SongTable songs={[songs]} />}
+                {true}
             </div>
         </BasicLayout>
killedBy: SongDetailsPage tests renders one song without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="SongTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/Songs/SongDetailsPage.js:31:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Song Details</h1>
-                {songs && <SongTable songs={[songs]} />}
+                {false}
             </div>
         </BasicLayout>
killedBy: SongDetailsPage tests renders one song without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="SongTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
