[Killed] ObjectLiteral
main/pages/Songs/SongEditPage.js:18:9
     } = useBackend(
         // Stryker disable next-line all : don't test internal caching of React Query
         [`/api/songs?id=${id}`],
-        {
-            // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-            method: "GET",
-            url: `/api/song`,
-            params: {
-                id,
-            },
-        }
+        {}
     );
 
killedBy: SongEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="SongForm-title"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/pages/Songs/SongEditPage.js:21:18
         {
             // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
             method: "GET",
-            url: `/api/song`,
+            url: ``,
             params: {
                 id,
killedBy: SongEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="SongForm-title"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/pages/Songs/SongEditPage.js:22:21
             // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
             method: "GET",
             url: `/api/song`,
-            params: {
-                id,
-            },
+            params: {},
         }
     );
killedBy: SongEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="SongForm-title"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/Songs/SongEditPage.js:28:36
         }
     );
 
-    const objectToAxiosPutParams = (song) => ({
-        url: "/api/song",
-        method: "PUT",
-        params: {
-            id: song.id,
-        },
-        data: {
-            title: song.title,
-            artist: song.artist,
-            album: song.album,
-        },
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (song) => {
killedBy: SongEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Song Updated - id: 17 title: Title2"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/Songs/SongEditPage.js:30:17
 
     const objectToAxiosPutParams = (song) => ({
         url: "/api/song",
-        method: "PUT",
+        method: "",
         params: {
             id: song.id,
killedBy: SongEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Song Updated - id: 17 title: Title2"
Received: "Song Updated - id: 17 title: Title1"

Number of calls: 1

[Killed] BlockStatement
main/pages/Songs/SongEditPage.js:41:33
         },
     });
 
-    const onSuccess = (song) => {
-        toast(`Song Updated - id: ${song.id} title: ${song.title}`);
-    };
+    const onSuccess = (song) => {};
 
     const mutation = useBackendMutation(
killedBy: SongEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Song Updated - id: 17 title: Title2"

Number of calls: 0

[Killed] BlockStatement
main/pages/Songs/SongEditPage.js:58:20
         mutation.mutate(data);
     };
 
-    if (isSuccess) {
-        return <Navigate to="/songs/list" />;
-    }
+    if (isSuccess) {}
 
     return (
killedBy: SongEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/songs/list"}

Number of calls: 0

[Killed] ConditionalExpression
main/pages/Songs/SongEditPage.js:66:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Song</h1>
-                {song && (
-                    <SongForm
-                        initialSong={song}
-                        submitAction={onSubmit}
-                        buttonLabel="Update"
-                    />
-                )}
+                {true}
             </div>
         </BasicLayout>
killedBy: SongEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="SongForm-title"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/Songs/SongEditPage.js:66:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Song</h1>
-                {song && (
-                    <SongForm
-                        initialSong={song}
-                        submitAction={onSubmit}
-                        buttonLabel="Update"
-                    />
-                )}
+                {false}
             </div>
         </BasicLayout>
killedBy: SongEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="SongForm-title"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
