[Killed] BlockStatement
main/pages/Songs/SongIndexPage.js:8:41
 import SongTable from "main/components/Songs/SongTable";
 import { useCurrentUser } from "main/utils/currentUser";
 
-export default function SongIndexPage() {
-    const currentUser = useCurrentUser();
-
-    const {
-        data: songs,
-        error: _error,
-        status: _status,
-    } = useBackend(
-        // Stryker disable next-line all : don't test internal caching of React Query
-        ["/api/song/all"],
-        { method: "GET", url: "/api/song/all" },
-        []
-    );
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Songs</h1>
-                <SongTable songs={songs} currentUser={currentUser} />
-            </div>
-        </BasicLayout>
-    );
-}
+export default function SongIndexPage() {}
 
killedBy: SongIndexPage tests renders without crashing for regular user
statusReason: Error: SongIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/pages/Songs/SongIndexPage.js:18:31
     } = useBackend(
         // Stryker disable next-line all : don't test internal caching of React Query
         ["/api/song/all"],
-        { method: "GET", url: "/api/song/all" },
+        { method: "GET", url: "" },
         []
     );
killedBy: SongIndexPage tests renders three songs without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="SongTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
