[Killed] StringLiteral
main/pages/UCSBDates/UCSBDatesEditPage.js:21:18
         {
             // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
             method: "GET",
-            url: `/api/ucsbdates`,
+            url: ``,
             params: {
                 id,
killedBy: UCSBDatesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBDateForm-quarterYYYYQ"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/pages/UCSBDates/UCSBDatesEditPage.js:34:15
         params: {
             id: ucsbDate.id,
         },
-        data: {
-            quarterYYYYQ: ucsbDate.quarterYYYYQ,
-            name: ucsbDate.name,
-            localDateTime: ucsbDate.localDateTime,
-        },
+        data: {},
     });
 
killedBy: UCSBDatesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"quarterYYYYQ\":\"20224\",\"name\":\"Christmas Morning\",\"localDateTime\":\"2022-12-25T08:00\"}"
Received: "{}"

[Killed] BlockStatement
main/pages/UCSBDates/UCSBDatesEditPage.js:58:20
         mutation.mutate(data);
     };
 
-    if (isSuccess) {
-        return <Navigate to="/ucsbdates/list" />;
-    }
+    if (isSuccess) {}
 
     return (
killedBy: UCSBDatesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ucsbdates/list"}

Number of calls: 0

[Killed] ConditionalExpression
main/pages/UCSBDates/UCSBDatesEditPage.js:66:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit UCSBDate</h1>
-                {ucsbDate && (
-                    <UCSBDateForm
-                        initialUCSBDate={ucsbDate}
-                        submitAction={onSubmit}
-                        buttonLabel="Update"
-                    />
-                )}
+                {true}
             </div>
         </BasicLayout>
killedBy: UCSBDatesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBDateForm-quarterYYYYQ"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/UCSBDates/UCSBDatesEditPage.js:66:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit UCSBDate</h1>
-                {ucsbDate && (
-                    <UCSBDateForm
-                        initialUCSBDate={ucsbDate}
-                        submitAction={onSubmit}
-                        buttonLabel="Update"
-                    />
-                )}
+                {ucsbDate || <UCSBDateForm initialUCSBDate={ucsbDate} submitAction={onSubmit} buttonLabel="Update" />}
             </div>
         </BasicLayout>
killedBy: UCSBDatesEditPage tests when the backend doesn't return a todo renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="UCSBDateForm-quarterYYYYQ" id="quarterYYYYQ" name="quarterYYYYQ" type="text" /> instead
