[Killed] StringLiteral
src/main/utils/restaurantUtils.js:11:14
 
 export function cellToAxiosParamsDelete(cell) {
     return {
-        url: "/api/restaurants",
+        url: "",
         method: "DELETE",
         params: {
killedBy: RestaurantIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Restaurant with id 2 was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
