[Killed] BlockStatement
src/main/utils/songUtils.js:9:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/song",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id,
-        },
-    };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: SongIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Song with id 2 was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
src/main/utils/songUtils.js:11:14
 
 export function cellToAxiosParamsDelete(cell) {
     return {
-        url: "/api/song",
+        url: "",
         method: "DELETE",
         params: {
killedBy: SongIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Song with id 2 was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
