[Survived] StringLiteral
main/components/Movies/MovieTable.js:47:21
             accessor: 'starring',
         },
         {
-            Header: 'Director',
+            Header: "",
             accessor: 'director',
         }
